"""
Необхідно створити функцію generator_numbers, яка буде аналізувати текст, ідентифікувати всі дійсні числа, що вважаються
частинами доходів, і повертати їх як генератор. Дійсні числа у тексті записані без помилок, чітко відокремлені пробілами
з обох боків. Також потрібно реалізувати функцію sum_profit, яка буде використовувати generator_numbers для
підсумовування цих чисел і обчислення загального прибутку.
"""
import re
from typing import Callable

# Функція генератор чисел для ідентифікації дійсних чисел в тексті
def generator_numbers(text: str):
    # Регулярний вираз для пошуку чисел в тексті
    pattern = r' -?\d+(\.\d+)?'
    matches = re.finditer(pattern, text)
    for match in matches:
        yield float(match.group()) # Повертаємо дійсні числа

# Функція для підсумовування прибутків за дійсними числами
def sum_profit(text: str, func: Callable):
    return sum(func(text))

# Приклад

text = ("Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими "
        "надходженнями 27.45 і 324.00 доларів.")
total_profit = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_profit}")